In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn import linear_model

In [3]:
df=pd.read_csv("homeprices.csv")
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

given are the home prices find out the home that has
3000 sq fit area, 3 bedrooms,40 year old
2500 sq fit area,4 bedrooms, 5 year old

# Data preprocessing

In [6]:
# here we can see that no of bedrooms are missing so lets replace it with median
df.bedrooms.median()

3.5

In [9]:
# 3.5 is float lets convert it to int
import math
median_bed=math.floor(df.bedrooms.median())
median_bed

3

In [12]:
df.bedrooms=df.bedrooms.fillna(median_bed)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [14]:
reg=linear_model.LinearRegression()

In [17]:
reg.fit(df[['area','bedrooms','age']],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [18]:
#predict  home price for 3000 sq fit area, 3 bedrooms,40 year old
reg.predict([[3000,3,40]])

array([444400.])

In [19]:
#predict  home price for 2500 sq fit area, 4 bedrooms,5 year old
reg.predict([[2500,4,5]])

array([588625.])